Courses/7140/Lectures/Abstraction/small-set.org
# -*- mode: org -*-
# -*- org-export-html-postamble:t; -*-
#+TITLE: Design of a SmallSet
#+AUTHOR: Prabhaker Mateti
#+OPTIONS: toc:t
#+LINK_HOME: ../../
#+LINK_UP: ../../Lectures
#+DESCRIPTION: CS7140 Software Engineering Lecture
#+STYLE: <style> @media screen {BODY {margin: 10%} }</style>
#+BIND: org-export-html-preamble-format (("en" "<a href=\"http://cecs.wright.edu/~pmateti/Courses/7140/\">CS 7140 Advanced Software Engineering</a>"))
#+BIND: org-export-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2013 %e &bull; <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a>"))

* Design Example: SmallSet
1. Illustrates abstraction in design
1. SmallSet Operations: Just the Names
   1. insert-an-item
   1. delete-an-item
   1. item-is-in-the-set
   1. number-of-items-in-the-set
   1. union-with
   1. diff-with
   1. cons
   1. All the above should be well-specified
   1. irrelevant detail:  item ==&gt; int
1. all the above converges to "API"
1. cf. http://docs.oracle.com/javase/7/docs/api/java/util/Set.html
1. Focus on the "method"
   1. not the size
   1. not the PL notation
   1. for now, not Java

* SmallSet Requirements Clarifications

1. No bigger than 1000 elements  
1. Insertions are far more frequent cf to other ops  
1. item-is-in-the-set(S, e): searched for again often
1. Some ops can "fail"

* SmallSet Operations: Signatures
   1. insert-an-item: Set, Item --> Set
   1. delete-an-item: Set, Item --> Set
   1. item-is-in-the-set: Set, Item --> Boolean
   1. number-of-items-in-the-set: Set, Item --> Integer
   1. union-with: Set, Set --> Set
   1. diff-with: Set, Set --> Set
   1. cons: --> Set

* SmallSet Operations: Semantics
1. insert-an-item(S, e): S.post = S.pre + {e}
1. item-is-in-the-set(S, e):
   1. False, if S == cons()
   1. True, if S == insert-an-item(T, e)  for some T
   1. False, if S != insert-an-item(T, e) for no T
   1. item-is-in-the-set(S, f) == ...
1. diff-with(A, B) yields  (A + B) - (A intersect B)


* Design of a Small Set Using an Array
1. int array A of fixed size, sz >=  1000  (Requirement R1)
1. least index A[i] unfilled, ux
1. duplicate items permitted (R2)
1. number-of-items-in-the-set, ne may be strictly < ux

** Design Documentation  

1. abstraction(A, ux) == S, the set S ::= {A[i] | 0 <= i < ux}
1. ux <= sz
   1.  initial value of ux == ?
1. Deducible: A[ux .. sz-1] vacant

* insert-an-item(S, e)

1. pre: ux  <  sz
1. post:  S == S.pre + {e}
1. impl:  A[ux] := e; ux++;

** Design Documentation  

1.  at pre item-is-in-the-set(S, e) may be true
1.  may be better: A[ux] := A[ 0]; ux++; A[ 0] := e;
1.  Is this design dependent on how is-in-the-set is designed?


* item-is-in-the-set(S, e)

1.  A[ux] := e; fx := linear-search(A, 0, ux);
1.  fx  <  ux?
    1.  if so  {swap A[fx] with A[ 0]}
1.  return (fx  <  ux)

** The idea of a sentinel

1. A[ux] := e;  (ux should now be < sz always)
1. without it linear search has two tests per iteration
1. swap done because of R3

* More Design Issues

1. Do we ever compact (delete dupes) the A[0 .. ux-1]?
   1.  As is our design is prone to fail
   1.  If we do, when do we do it?
   1.  "All" the time?
1.  Is this design or implementation?
1.  Concurrency?


* Class Invariants



