Courses/7140/Lectures/Examples/Small-Set/Small-Set-2016/small-set.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Design of a SmallSet</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Design of a SmallSet"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-17T02:27-0400"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">
<a href="http://cecs.wright.edu/~pmateti/Courses/7140/">CS 7140 Advanced Software Engineering</a>
</div>

<div id="content">
<h1 class="title">Design of a SmallSet</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Design Example: SmallSet</a></li>
<li><a href="#sec-2">2 SmallSet Requirements Clarifications</a></li>
<li><a href="#sec-3">3 SmallSet Operations: Signatures</a></li>
<li><a href="#sec-4">4 SmallSet Operations: Semantics</a></li>
<li><a href="#sec-5">5 Design of a Small Set Using an Array</a>
<ul>
<li><a href="#sec-5-1">5.1 Design Documentation</a></li>
</ul>
</li>
<li><a href="#sec-6">6 insert-an-item(S, e)</a>
<ul>
<li><a href="#sec-6-1">6.1 Design Documentation</a></li>
</ul>
</li>
<li><a href="#sec-7">7 item-is-in-the-set(S, e)</a>
<ul>
<li><a href="#sec-7-1">7.1 The idea of a sentinel</a></li>
</ul>
</li>
<li><a href="#sec-8">8 More Design Issues</a></li>
<li><a href="#sec-9">9 Class Invariants</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Design Example: SmallSet</h2>
<div class="outline-text-2" id="text-1">

<ol>
<li>Illustrates abstraction in design
</li>
<li>SmallSet Operations: Just the Names
<ol>
<li>insert-an-item
</li>
<li>delete-an-item
</li>
<li>item-is-in-the-set
</li>
<li>number-of-items-in-the-set
</li>
<li>union-with
</li>
<li>diff-with
</li>
<li>cons
</li>
<li>All the above should be well-specified
</li>
<li>irrelevant detail:  item ==&amp;gt; int
</li>
</ol>

</li>
<li>all the above converges to "API"
</li>
<li>cf. <a href="http://docs.oracle.com/javase/7/docs/api/java/util/Set.html">http://docs.oracle.com/javase/7/docs/api/java/util/Set.html</a>
</li>
<li>Focus on the "method"
<ol>
<li>not the size
</li>
<li>not the PL notation
</li>
<li>for now, not Java
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> SmallSet Requirements Clarifications</h2>
<div class="outline-text-2" id="text-2">


<ol>
<li>No bigger than 1000 elements  
</li>
<li>Insertions are far more frequent cf to other ops  
</li>
<li>item-is-in-the-set(S, e): searched for again often
</li>
<li>Some ops can "fail"
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> SmallSet Operations: Signatures</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>insert-an-item: Set, Item &ndash;&gt; Set
</li>
<li>delete-an-item: Set, Item &ndash;&gt; Set
</li>
<li>item-is-in-the-set: Set, Item &ndash;&gt; Boolean
</li>
<li>number-of-items-in-the-set: Set, Item &ndash;&gt; Integer
</li>
<li>union-with: Set, Set &ndash;&gt; Set
</li>
<li>diff-with: Set, Set &ndash;&gt; Set
</li>
<li>cons: &ndash;&gt; Set
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SmallSet Operations: Semantics</h2>
<div class="outline-text-2" id="text-4">

<ol>
<li>insert-an-item(S, e): S.post = S.pre + {e}
</li>
<li>item-is-in-the-set(S, e):
<ol>
<li>False, if S == cons()
</li>
<li>True, if S == insert-an-item(T, e)  for some T
</li>
<li>False, if S != insert-an-item(T, e) for no T
</li>
<li>item-is-in-the-set(S, f) == &hellip;
</li>
</ol>

</li>
<li>diff-with(A, B) yields  (A + B) - (A intersect B)
</li>
</ol>



</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Design of a Small Set Using an Array</h2>
<div class="outline-text-2" id="text-5">

<ol>
<li>int array A of fixed size, sz &gt;=  1000  (Requirement R1)
</li>
<li>least index A[i] unfilled, ux
</li>
<li>duplicate items permitted (R2)
</li>
<li>number-of-items-in-the-set, ne may be strictly &lt; ux
</li>
</ol>



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Design Documentation</h3>
<div class="outline-text-3" id="text-5-1">


<ol>
<li>abstraction(A, ux) == S, the set S ::= {A[i] | 0 &lt;= i &lt; ux}
</li>
<li>ux &lt;= sz
<ol>
<li>initial value of ux == ?
</li>
</ol>

</li>
<li>Deducible: A[ux .. sz-1] vacant
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> insert-an-item(S, e)</h2>
<div class="outline-text-2" id="text-6">


<ol>
<li>pre: ux  &lt;  sz
</li>
<li>post:  S == S.pre + {e}
</li>
<li>impl:  A[ux] := e; ux++;
</li>
</ol>



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Design Documentation</h3>
<div class="outline-text-3" id="text-6-1">


<ol>
<li>at pre item-is-in-the-set(S, e) may be true
</li>
<li>may be better: A[ux] := A[ 0]; ux++; A[ 0] := e;
</li>
<li>Is this design dependent on how is-in-the-set is designed?
</li>
</ol>



</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> item-is-in-the-set(S, e)</h2>
<div class="outline-text-2" id="text-7">


<ol>
<li>A[ux] := e; fx := linear-search(A, 0, ux);
</li>
<li>fx  &lt;  ux?
<ol>
<li>if so  {swap A[fx] with A[ 0]}
</li>
</ol>

</li>
<li>return (fx  &lt;  ux)
</li>
</ol>



</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> The idea of a sentinel</h3>
<div class="outline-text-3" id="text-7-1">


<ol>
<li>A[ux] := e;  (ux should now be &lt; sz always)
</li>
<li>without it linear search has two tests per iteration
</li>
<li>swap done because of R3
</li>
</ol>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> More Design Issues</h2>
<div class="outline-text-2" id="text-8">


<ol>
<li>Do we ever compact (delete dupes) the A[0 .. ux-1]?
<ol>
<li>As is our design is prone to fail
</li>
<li>If we do, when do we do it?
</li>
<li>"All" the time?
</li>
</ol>

</li>
<li>Is this design or implementation?
</li>
<li>Concurrency?
</li>
</ol>



</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Class Invariants</h2>
<div class="outline-text-2" id="text-9">




</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
